DETRAudio(
  (backbone): CustomTokenizedBackbone(
    (collapse_channels): Conv2d(1, 1, kernel_size=(1, 1), stride=(1, 1), bias=False)
    (patch_conv): Conv2d(1, 1, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), bias=False)
    (adaptive_pool): AdaptiveAvgPool2d(output_size=(1, 1024))
    (dropout): Dropout(p=0.1, inplace=False)
  )
  (input_proj): Conv2d(1024, 1024, kernel_size=(1, 1), stride=(1, 1))
  (positional_encoding): TwoDPositionalEncoding()
  (transformer): Transformer(
    (encoder): TransformerEncoder(
      (layers): ModuleList(
        (0-3): 4 x TransformerEncoderLayer(
          (self_attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (linear1): Linear(in_features=1024, out_features=2048, bias=True)
          (dropout): Dropout(p=0.1, inplace=False)
          (linear2): Linear(in_features=2048, out_features=1024, bias=True)
          (norm1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (norm2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (dropout1): Dropout(p=0.1, inplace=False)
          (dropout2): Dropout(p=0.1, inplace=False)
        )
      )
      (norm): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
    )
    (decoder): TransformerDecoder(
      (layers): ModuleList(
        (0-5): 6 x TransformerDecoderLayer(
          (self_attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (multihead_attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=1024, out_features=1024, bias=True)
          )
          (linear1): Linear(in_features=1024, out_features=2048, bias=True)
          (dropout): Dropout(p=0.1, inplace=False)
          (linear2): Linear(in_features=2048, out_features=1024, bias=True)
          (norm1): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (norm2): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (norm3): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
          (dropout1): Dropout(p=0.1, inplace=False)
          (dropout2): Dropout(p=0.1, inplace=False)
          (dropout3): Dropout(p=0.1, inplace=False)
        )
      )
      (norm): LayerNorm((1024,), eps=1e-05, elementwise_affine=True)
    )
  )
  (query_embed): Embedding(150, 1024)
  (class_embed_note_type): MLP(
    (layers): ModuleList(
      (0): Linear(in_features=1024, out_features=1024, bias=True)
      (1): ReLU()
      (2): Linear(in_features=1024, out_features=1024, bias=True)
      (3): ReLU()
      (4): Linear(in_features=1024, out_features=1024, bias=True)
      (5): ReLU()
      (6): Linear(in_features=1024, out_features=1024, bias=True)
      (7): ReLU()
      (8): Linear(in_features=1024, out_features=1024, bias=True)
      (9): ReLU()
      (10): Linear(in_features=1024, out_features=1024, bias=True)
      (11): ReLU()
      (12): Linear(in_features=1024, out_features=1024, bias=True)
      (13): ReLU()
      (14): Linear(in_features=1024, out_features=1024, bias=True)
      (15): ReLU()
      (16): Linear(in_features=1024, out_features=1024, bias=True)
      (17): ReLU()
      (18): Linear(in_features=1024, out_features=1024, bias=True)
      (19): ReLU()
      (20): Linear(in_features=1024, out_features=1024, bias=True)
      (21): ReLU()
      (22): Linear(in_features=1024, out_features=1024, bias=True)
      (23): ReLU()
      (24): Linear(in_features=1024, out_features=1024, bias=True)
      (25): ReLU()
      (26): Linear(in_features=1024, out_features=1024, bias=True)
      (27): ReLU()
      (28): Linear(in_features=1024, out_features=1024, bias=True)
      (29): ReLU()
      (30): Linear(in_features=1024, out_features=1024, bias=True)
      (31): ReLU()
      (32): Linear(in_features=1024, out_features=1024, bias=True)
      (33): ReLU()
      (34): Linear(in_features=1024, out_features=3, bias=True)
    )
    (residual_transforms): ModuleList(
      (0-2): 3 x Identity()
    )
  )
  (class_embed_instrument): MLP(
    (layers): ModuleList(
      (0): Linear(in_features=1024, out_features=1024, bias=True)
      (1): ReLU()
      (2): Linear(in_features=1024, out_features=1024, bias=True)
      (3): ReLU()
      (4): Linear(in_features=1024, out_features=1024, bias=True)
      (5): ReLU()
      (6): Linear(in_features=1024, out_features=1024, bias=True)
      (7): ReLU()
      (8): Linear(in_features=1024, out_features=1024, bias=True)
      (9): ReLU()
      (10): Linear(in_features=1024, out_features=1024, bias=True)
      (11): ReLU()
      (12): Linear(in_features=1024, out_features=1024, bias=True)
      (13): ReLU()
      (14): Linear(in_features=1024, out_features=1024, bias=True)
      (15): ReLU()
      (16): Linear(in_features=1024, out_features=1024, bias=True)
      (17): ReLU()
      (18): Linear(in_features=1024, out_features=1024, bias=True)
      (19): ReLU()
      (20): Linear(in_features=1024, out_features=1024, bias=True)
      (21): ReLU()
      (22): Linear(in_features=1024, out_features=1024, bias=True)
      (23): ReLU()
      (24): Linear(in_features=1024, out_features=1024, bias=True)
      (25): ReLU()
      (26): Linear(in_features=1024, out_features=1024, bias=True)
      (27): ReLU()
      (28): Linear(in_features=1024, out_features=1024, bias=True)
      (29): ReLU()
      (30): Linear(in_features=1024, out_features=1024, bias=True)
      (31): ReLU()
      (32): Linear(in_features=1024, out_features=1024, bias=True)
      (33): ReLU()
      (34): Linear(in_features=1024, out_features=6, bias=True)
    )
    (residual_transforms): ModuleList(
      (0-2): 3 x Identity()
    )
  )
  (class_embed_pitch): MLP(
    (layers): ModuleList(
      (0): Linear(in_features=1024, out_features=1024, bias=True)
      (1): ReLU()
      (2): Linear(in_features=1024, out_features=1024, bias=True)
      (3): ReLU()
      (4): Linear(in_features=1024, out_features=1024, bias=True)
      (5): ReLU()
      (6): Linear(in_features=1024, out_features=1024, bias=True)
      (7): ReLU()
      (8): Linear(in_features=1024, out_features=1024, bias=True)
      (9): ReLU()
      (10): Linear(in_features=1024, out_features=1024, bias=True)
      (11): ReLU()
      (12): Linear(in_features=1024, out_features=1024, bias=True)
      (13): ReLU()
      (14): Linear(in_features=1024, out_features=1024, bias=True)
      (15): ReLU()
      (16): Linear(in_features=1024, out_features=1024, bias=True)
      (17): ReLU()
      (18): Linear(in_features=1024, out_features=1024, bias=True)
      (19): ReLU()
      (20): Linear(in_features=1024, out_features=1024, bias=True)
      (21): ReLU()
      (22): Linear(in_features=1024, out_features=1024, bias=True)
      (23): ReLU()
      (24): Linear(in_features=1024, out_features=1024, bias=True)
      (25): ReLU()
      (26): Linear(in_features=1024, out_features=1024, bias=True)
      (27): ReLU()
      (28): Linear(in_features=1024, out_features=1024, bias=True)
      (29): ReLU()
      (30): Linear(in_features=1024, out_features=1024, bias=True)
      (31): ReLU()
      (32): Linear(in_features=1024, out_features=1024, bias=True)
      (33): ReLU()
      (34): Linear(in_features=1024, out_features=129, bias=True)
    )
    (residual_transforms): ModuleList(
      (0-2): 3 x Identity()
    )
  )
  (start_time_head): MLP(
    (layers): ModuleList(
      (0): Linear(in_features=1024, out_features=1024, bias=True)
      (1): ReLU()
      (2): Linear(in_features=1024, out_features=1024, bias=True)
      (3): ReLU()
      (4): Linear(in_features=1024, out_features=1024, bias=True)
      (5): ReLU()
      (6): Linear(in_features=1024, out_features=1024, bias=True)
      (7): ReLU()
      (8): Linear(in_features=1024, out_features=1024, bias=True)
      (9): ReLU()
      (10): Linear(in_features=1024, out_features=1024, bias=True)
      (11): ReLU()
      (12): Linear(in_features=1024, out_features=1024, bias=True)
      (13): ReLU()
      (14): Linear(in_features=1024, out_features=1024, bias=True)
      (15): ReLU()
      (16): Linear(in_features=1024, out_features=1024, bias=True)
      (17): ReLU()
      (18): Linear(in_features=1024, out_features=1024, bias=True)
      (19): ReLU()
      (20): Linear(in_features=1024, out_features=1024, bias=True)
      (21): ReLU()
      (22): Linear(in_features=1024, out_features=1024, bias=True)
      (23): ReLU()
      (24): Linear(in_features=1024, out_features=1024, bias=True)
      (25): ReLU()
      (26): Linear(in_features=1024, out_features=1024, bias=True)
      (27): ReLU()
      (28): Linear(in_features=1024, out_features=1024, bias=True)
      (29): ReLU()
      (30): Linear(in_features=1024, out_features=1024, bias=True)
      (31): ReLU()
      (32): Linear(in_features=1024, out_features=1024, bias=True)
      (33): ReLU()
      (34): Linear(in_features=1024, out_features=1, bias=True)
      (35): ReLU()
    )
    (residual_transforms): ModuleList(
      (0-2): 3 x Identity()
    )
  )
  (duration_head): MLP(
    (layers): ModuleList(
      (0): Linear(in_features=1024, out_features=1024, bias=True)
      (1): ReLU()
      (2): Linear(in_features=1024, out_features=1024, bias=True)
      (3): ReLU()
      (4): Linear(in_features=1024, out_features=1024, bias=True)
      (5): ReLU()
      (6): Linear(in_features=1024, out_features=1024, bias=True)
      (7): ReLU()
      (8): Linear(in_features=1024, out_features=1024, bias=True)
      (9): ReLU()
      (10): Linear(in_features=1024, out_features=1024, bias=True)
      (11): ReLU()
      (12): Linear(in_features=1024, out_features=1024, bias=True)
      (13): ReLU()
      (14): Linear(in_features=1024, out_features=1024, bias=True)
      (15): ReLU()
      (16): Linear(in_features=1024, out_features=1024, bias=True)
      (17): ReLU()
      (18): Linear(in_features=1024, out_features=1024, bias=True)
      (19): ReLU()
      (20): Linear(in_features=1024, out_features=1024, bias=True)
      (21): ReLU()
      (22): Linear(in_features=1024, out_features=1024, bias=True)
      (23): ReLU()
      (24): Linear(in_features=1024, out_features=1024, bias=True)
      (25): ReLU()
      (26): Linear(in_features=1024, out_features=1024, bias=True)
      (27): ReLU()
      (28): Linear(in_features=1024, out_features=1024, bias=True)
      (29): ReLU()
      (30): Linear(in_features=1024, out_features=1024, bias=True)
      (31): ReLU()
      (32): Linear(in_features=1024, out_features=1024, bias=True)
      (33): ReLU()
      (34): Linear(in_features=1024, out_features=1, bias=True)
      (35): ReLU()
    )
    (residual_transforms): ModuleList(
      (0-2): 3 x Identity()
    )
  )
  (velocity_head): MLP(
    (layers): ModuleList(
      (0): Linear(in_features=1024, out_features=1024, bias=True)
      (1): ReLU()
      (2): Linear(in_features=1024, out_features=1024, bias=True)
      (3): ReLU()
      (4): Linear(in_features=1024, out_features=1024, bias=True)
      (5): ReLU()
      (6): Linear(in_features=1024, out_features=1024, bias=True)
      (7): ReLU()
      (8): Linear(in_features=1024, out_features=1024, bias=True)
      (9): ReLU()
      (10): Linear(in_features=1024, out_features=1024, bias=True)
      (11): ReLU()
      (12): Linear(in_features=1024, out_features=1024, bias=True)
      (13): ReLU()
      (14): Linear(in_features=1024, out_features=1024, bias=True)
      (15): ReLU()
      (16): Linear(in_features=1024, out_features=1024, bias=True)
      (17): ReLU()
      (18): Linear(in_features=1024, out_features=1024, bias=True)
      (19): ReLU()
      (20): Linear(in_features=1024, out_features=1024, bias=True)
      (21): ReLU()
      (22): Linear(in_features=1024, out_features=1024, bias=True)
      (23): ReLU()
      (24): Linear(in_features=1024, out_features=1024, bias=True)
      (25): ReLU()
      (26): Linear(in_features=1024, out_features=1024, bias=True)
      (27): ReLU()
      (28): Linear(in_features=1024, out_features=1024, bias=True)
      (29): ReLU()
      (30): Linear(in_features=1024, out_features=1024, bias=True)
      (31): ReLU()
      (32): Linear(in_features=1024, out_features=1024, bias=True)
      (33): ReLU()
      (34): Linear(in_features=1024, out_features=1, bias=True)
      (35): ReLU()
    )
    (residual_transforms): ModuleList(
      (0-2): 3 x Identity()
    )
  )
)